<a href="https://colab.research.google.com/github/gtzambranop/UN_2020_2/blob/DCD/DCD/module_2/basic_python_class_06.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **"Pyhton Básico"**

* **Profesor:** Francisco Javier Ospina Salazar
* **Monitoras:**
  - Diana Carolina Sanchez Perez
  - Guiselle Tatiana Zambrano Penagos
* **Fechas:** 
  - Inicio: 2020-09-12
  - Final: 2020-09-29
* [Presentacióón del curso](http://ospinafrancisco.com/)


## Contenido de la clase

- Operaciones entre tablas de datos
  - Joins (uniones)
- Creación de filas o columnas en tablas
  - Añadir columas
  - Broadcasting
  - Añadir filas
  - Concatenación
- Operaciones útiles con DataFrames
  - Multi-indexamiento
    - Agregaciones por niveles de indexamiento
  - Tablas pivote
  - Selección de sub-dataframes
  - Ordenamientos
  - Iteraciones sobre grupos
  - Agregaciones sobre grupos
  - Tablas cruzadas

# Informacióón adicional

## Diferencia entre métodos y funciones

Una **función** es una pieza de código que se llama por nombre. Se puede pasar datos para operar (es decir, los parámetros) y opcionalmente puede devolver datos (el valor de retorno). Todos los datos que se pasan a una función se pasan explícitamente. 

Un **método** es una porción de código que es llamado por un nombre que está asociado con un objeto. En la mayoría de los aspectos, es idéntica a una función, excepto por dos diferencias clave:

- Un método se pasa implícitamente al objeto sobre el que se llamó.
- Un método puede operar con datos contenidos en la clase (recordando que un objeto es una instancia de una clase, la clase es la definición, el objeto es una instancia de esa información).

Una **función** puede retornar un resultado o realizar una accióón agena al objeto. Un **método** modifica y trabaja directamente con el objeto.

### Ejemplo método

In [448]:
# Se define un diccionario
dc = {'a': 1}
dc

{'a': 1}

In [449]:
# El método update actualiza el diccionario directamente
dc.update({'b': 2})
dc

{'a': 1, 'b': 2}

In [564]:
def exponentiation_method(list_base, exponent=2):
  # Se sobrescriben los datos de list_base
  for i in range(len(list_base)):
    list_base[i] = list_base[i] ** exponent

In [562]:
# Lista de números pares en el rango [0, 10)
list_1 = list(range(0, 10, 2)) 
print(list_1)

[0, 2, 4, 6, 8]

In [565]:
exponentiation_method(list_1)

In [567]:
# Se modificó directamente la lista original
list_1

[0, 4, 16, 36, 64]

### Ejemplo función

In [568]:
# Lista de números pares en el rango [0, 10)
list_1 = list(range(0, 10, 2)) 
print(list_1)

[0, 2, 4, 6, 8]

In [571]:
def exponentiation_function(list_base, exponent=2):
  # Se crea una nueva lista, la lista de entrada NO se modifica
  list_2 = [x**exponent for x in list_base]
  return list_2

In [569]:
# La lista original no se modifica, pero se retorna una nueva lista con los
# cambios requeridos
list_2 = exponentiation_function(list_1, 3)
list_2

[0, 16, 256, 1296, 4096]

In [555]:
list_1

[0, 2, 4, 6, 8]

In [556]:
exponentiation_2(list_1, 2)

In [557]:
# La lista original se modificó
list_1

[0, 4, 16, 36, 64]

In [450]:
import pandas as pd 
import numpy as np

# Operaciones de tablas en Pandas

## Operaciones entre tablas de datos
* Joins
* Concatenación de tablas
  * Añadir columas
  * Añadir filas

### Joins

**Nota:** 


Como ejemplos para ver la funcionalidad de los joins se tomaran las tablas que se usan como ejemplo en la sección de [joins de Wikipedia](https://es.wikipedia.org/wiki/Join)

![join](https://ingenieriadesoftware.es/wp-content/uploads/2018/07/sqljoin.jpeg)

In [476]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})


Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento': [31, 33, 34, 35]})

In [477]:
print(Empleado)
print('-' * 50)
print(Departamento)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
--------------------------------------------------
  NombreDepartamento  IDDepartamento
0             Ventas              31
1         Ingeniería              33
2         Producción              34
3           Mercadeo              35

#### Inner join.

El inner join mezcla las dos tablas por columna dejando únicamente las filas que hacen **match** en ambas tablas. Inner es el join por defecto en Pandas.

In [478]:
pd.merge(Empleado, Departamento) # La columna IDDepartamento solo queda una vez

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción

In [479]:
Empleado.merge(Departamento) # Forma alterna

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción

#### Left join

El left join mezcla las dos tablas por columna, dejando todas las filas de la tabla izquierda y solo las de la derecha que hacen match; el resto de registros lo llena con nulos.

In [480]:
# Se hace la operacióón left y luego el resultado es asignado a df_merged
df_merged = pd.merge(Empleado, Departamento, how='left') 
df_merged

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5     Gaspar              36                NaN

#### Right join

El Right join mezcla las dos tablas por columna, dejando todas las filas de la tabla derecha y solo las de la izquierda que hacen match; el resto de registros lo llena con nulos.

In [481]:
pd.merge(Empleado, Departamento, how='right')

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5        NaN              35           Mercadeo

#### Outer join (Full outer join)
El Outer join mezcla las dos tablas por columna, dejando todas las filas de ambas tablas independientemente si hay match o no.

In [482]:
pd.merge(Empleado, Departamento, how='outer')

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5     Gaspar              36                NaN
6        NaN              35           Mercadeo

#### Full join

El Full join mezcla las dos tablas por columna, dejando solo las filas de ambas tablas que no hicieron match.

In [483]:
df_merged = pd.merge(Empleado, Departamento, how='outer')
# Retorna lo que no hizo match
df_merged[np.logical_or(df_merged.Apellido.isna(), df_merged.NombreDepartamento.isna())]

  Apellido  IDDepartamento NombreDepartamento
5   Gaspar              36                NaN
6      NaN              35           Mercadeo

#### Algunas funcionalidades adicionales de todos los joins dentro de pandas

In [484]:
# Decidir la columna por la cual se hace el join explicitamente
Empleado.columns = ['Nombre', 'IDDepartamento']
Departamento.columns = ['Nombre', 'IDDepartamento']

In [485]:
print(Empleado)
print('-' * 50)
print(Departamento)

      Nombre  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
--------------------------------------------------
       Nombre  IDDepartamento
0      Ventas              31
1  Ingeniería              33
2  Producción              34
3    Mercadeo              35

In [486]:
pd.merge(Empleado, Departamento)

Empty DataFrame
Columns: [Nombre, IDDepartamento]
Index: []

In [487]:
pd.merge(Empleado, Departamento, on='IDDepartamento') # En caso de haber múltiples columnas que hagan match

    Nombre_x  IDDepartamento    Nombre_y
0    Andrade              31      Ventas
1     Jordán              33  Ingeniería
2  Steinberg              33  Ingeniería
3   Róbinson              34  Producción
4     Zolano              34  Producción

In [488]:
# Prefijos para distiguir variables
pd.merge(Empleado, Departamento, on='IDDepartamento', suffixes=('_emp','_dep')) # Sufijo personalizado

  Nombre_emp  IDDepartamento  Nombre_dep
0    Andrade              31      Ventas
1     Jordán              33  Ingeniería
2  Steinberg              33  Ingeniería
3   Róbinson              34  Producción
4     Zolano              34  Producción

In [572]:
# Columnas para match con diferente nombre
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})


Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento2': [31, 33, 34, 35]})
print(Empleado)
print(Departamento)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
  NombreDepartamento  IDDepartamento2
0             Ventas               31
1         Ingeniería               33
2         Producción               34
3           Mercadeo               35

In [490]:
# Error, no hay nada igual entre ambas tablas
#pd.merge(Empleado, Departamento)

In [573]:
pd.merge(Empleado, Departamento, left_on='IDDepartamento', right_on='IDDepartamento2')

    Apellido  IDDepartamento NombreDepartamento  IDDepartamento2
0    Andrade              31             Ventas               31
1     Jordán              33         Ingeniería               33
2  Steinberg              33         Ingeniería               33
3   Róbinson              34         Producción               34
4     Zolano              34         Producción               34

##### Join por la indexación

In [492]:
Empleado2 = Empleado.copy()
Empleado2.index = Empleado2.IDDepartamento
Empleado2

                 Apellido  IDDepartamento
IDDepartamento
31                Andrade              31
33                 Jordán              33
33              Steinberg              33
34               Róbinson              34
34                 Zolano              34
36                 Gaspar              36

In [493]:
Departamento2 = Departamento.copy()
Departamento2.index = Departamento2.IDDepartamento2
Departamento2

                NombreDepartamento  IDDepartamento2
IDDepartamento2
31                          Ventas               31
33                      Ingeniería               33
34                      Producción               34
35                        Mercadeo               35

In [494]:
Empleado2 = Empleado2[['Apellido']]
Empleado2

                 Apellido
IDDepartamento
31                Andrade
33                 Jordán
33              Steinberg
34               Róbinson
34                 Zolano
36                 Gaspar

In [495]:
Departamento2 = Departamento2[['NombreDepartamento']]
Departamento2

                NombreDepartamento
IDDepartamento2
31                          Ventas
33                      Ingeniería
34                      Producción
35                        Mercadeo

In [496]:
print(Empleado)
print('-' * 35)
print(Departamento)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
-----------------------------------
  NombreDepartamento  IDDepartamento2
0             Ventas               31
1         Ingeniería               33
2         Producción               34
3           Mercadeo               35

In [497]:
print(Empleado2)
print('-' * 35)
print(Departamento2)

                 Apellido
IDDepartamento
31                Andrade
33                 Jordán
33              Steinberg
34               Róbinson
34                 Zolano
36                 Gaspar
-----------------------------------
                NombreDepartamento
IDDepartamento2
31                          Ventas
33                      Ingeniería
34                      Producción
35                        Mercadeo

In [498]:
pd.merge(Empleado2, Departamento2, left_index=True, right_index=True)

     Apellido NombreDepartamento
31    Andrade             Ventas
33     Jordán         Ingeniería
33  Steinberg         Ingeniería
34   Róbinson         Producción
34     Zolano         Producción

## Añadir filas o columnas a dataframes DataFrames y Series
* Por inserción directa
* Por Concatenación

In [499]:
# Añadir columna

Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [500]:
nombres = ['Francisco', 'Edgar', 'Marta', 'Luciana', 'David', 'María']

# Asignación creando un objeto nuevo
Empleado2 = Empleado.assign(Nombre=nombres)
Empleado2

# Asignación modificando el objeto original
#Empleado['Nombre'] = nombres
#Empleado

    Apellido  IDDepartamento     Nombre
0    Andrade              31  Francisco
1     Jordán              33      Edgar
2  Steinberg              33      Marta
3   Róbinson              34    Luciana
4     Zolano              34      David
5     Gaspar              36      María

In [501]:
# Se ordenan las columnas de la tabla y se asigna el resultado de la tabla
# ordenada a Empleado3
Empleado3 = Empleado2[['Nombre', 'Apellido', 'IDDepartamento']]
Empleado3

      Nombre   Apellido  IDDepartamento
0  Francisco    Andrade              31
1      Edgar     Jordán              33
2      Marta  Steinberg              33
3    Luciana   Róbinson              34
4      David     Zolano              34
5      María     Gaspar              36

In [502]:
# No se modifica la tabla original
Empleado2

    Apellido  IDDepartamento     Nombre
0    Andrade              31  Francisco
1     Jordán              33      Edgar
2  Steinberg              33      Marta
3   Róbinson              34    Luciana
4     Zolano              34      David
5     Gaspar              36      María

In [503]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento     Nombre
0    Andrade              31  Francisco
1     Jordán              33      Edgar
2  Steinberg              33      Marta
3   Róbinson              34    Luciana
4     Zolano              34      David
5     Gaspar              36      María
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [504]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [505]:
nuevo_empleado = [('Ospina', 33)]
  
# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)
Empleado2

    Apellido  IDDepartamento       0     1
0    Andrade            31.0     NaN   NaN
1     Jordán            33.0     NaN   NaN
2  Steinberg            33.0     NaN   NaN
3   Róbinson            34.0     NaN   NaN
4     Zolano            34.0     NaN   NaN
5     Gaspar            36.0     NaN   NaN
6        NaN             NaN  Ospina  33.0

In [506]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
nuevo_empleado = [{'Apellido': 'Ospina', 'IDDepartamento': 33}]

# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)
Empleado2

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              33

In [507]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

# Asignación creando un objeto nuevo
nuevo_empleado = pd.Series(['Ospina', 37], index=['Apellido', 'IDDepartamento'])
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)
Empleado2

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

In [508]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

# Asignación modificando el objeto original
Empleado.loc[6] = ['Ospina', 37]
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

In [509]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

In [510]:
# Corregir la ubicacion de los nuevos datos
# Sin embargo se conserva el problema del indice '0'
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
nuevo_empleado = [{'Apellido': 'Ospina', 'IDDepartamento': 33}]

print(nuevo_empleado)

Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)

[{'Apellido': 'Ospina', 'IDDepartamento': 33}]

In [511]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              33
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [512]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

nuevo_empleado = pd.Series(['Ospina', 37], index=['Apellido', 'IDDepartamento'])
print(nuevo_empleado)
print(nuevo_empleado.index)
# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)

Apellido          Ospina
IDDepartamento        37
dtype: object
Index(['Apellido', 'IDDepartamento'], dtype='object')

In [513]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [514]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})

nuevo_empleado = pd.Series(['Ospina'], index=['Apellido'])
print(nuevo_empleado)
print(nuevo_empleado.index)
# Asignación creando un objeto nuevo
Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)

Apellido    Ospina
dtype: object
Index(['Apellido'], dtype='object')

In [515]:
print(Empleado2)
print('-'*40)
print(Empleado)

    Apellido  IDDepartamento
0    Andrade            31.0
1     Jordán            33.0
2  Steinberg            33.0
3   Róbinson            34.0
4     Zolano            34.0
5     Gaspar            36.0
6     Ospina             NaN
----------------------------------------
    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36

In [516]:
# Asignación modificando el objeto original
Empleado.loc[6] = ['Ospina', 37]
Empleado

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
6     Ospina              37

## Boadcasting con Dataframes

In [517]:
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento': [31, 33, 34, 35]})

Empleado['Edad'] = [20,23,45,48,56,32]

Empleado['Edad_meses'] = Empleado['Edad'] * 12

Empleado.drop(5)

    Apellido  IDDepartamento  Edad  Edad_meses
0    Andrade              31    20         240
1     Jordán              33    23         276
2  Steinberg              33    45         540
3   Róbinson              34    48         576
4     Zolano              34    56         672

### ¿Cuándo no usar Broadcasting?

No se usa broadcasting cuando la operación es compleja

In [518]:
df_merge = pd.merge(Empleado, Departamento, how='left')

str_list = []

for index, row in df_merge.iterrows():
    str_list.append('El empleado {} trabaja en el departamento de {}'.format(row['Apellido'], 
                                                                             row['IDDepartamento']))
    
df_merge['Comentario'] = str_list
df_merge

    Apellido  ...                                         Comentario
0    Andrade  ...  El empleado Andrade trabaja en el departamento...
1     Jordán  ...  El empleado Jordán trabaja en el departamento ...
2  Steinberg  ...  El empleado Steinberg trabaja en el departamen...
3   Róbinson  ...  El empleado Róbinson trabaja en el departament...
4     Zolano  ...  El empleado Zolano trabaja en el departamento ...
5     Gaspar  ...  El empleado Gaspar trabaja en el departamento ...

[6 rows x 6 columns]

### Concatenación de Series

In [519]:
Ser1 = pd.Series([1,2], index=['a', 'b'])
Ser2 = pd.Series([2,3,4,5], index=['a', 'b', 'c', 'd'])

pd.concat([Ser1, Ser2], axis=0)

a    1
b    2
a    2
b    3
c    4
d    5
dtype: int64

In [520]:
Ser1 = pd.Series([1,2], index=['a', 'b'])
Ser2 = pd.Series([2,3,4,5], index=['a', 'b', 'c', 'd'])
pd.concat([Ser1, Ser2], axis=1)

     0  1
a  1.0  2
b  2.0  3
c  NaN  4
d  NaN  5

## Concatenación de DataFrames

In [521]:
df1 = pd.DataFrame({'var_1': [1,2], 'var_2': [3,4]})
df2 = pd.DataFrame({'var_3': [5,6], 'var_2': [7,8]})

pd.concat([df1, df2])

   var_1  var_2  var_3
0    1.0      3    NaN
1    2.0      4    NaN
0    NaN      7    5.0
1    NaN      8    6.0

In [522]:
df1 = pd.DataFrame({'var_1': [1,2], 'var_2': [3,4]})
df2 = pd.DataFrame({'var_3': [5,6], 'var_2': [7,8]})

pd.concat([df1, df2], axis=1) # Es importante renombrar columnas

   var_1  var_2  var_3  var_2
0      1      3      5      7
1      2      4      6      8

In [523]:
# Resultados raros
pd.concat([df1, df2], axis=1)['var_2']

   var_2  var_2
0      3      7
1      4      8

## Operaciones adicionales útiles con Pandas

### Multi-indexamiento

In [524]:
import numpy as np
import pandas as pd

df_ventas = pd.DataFrame({'Oficina': [1,1,1,2,2,2,3,3,3,3],
                          'Producto': ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d'],
                          'Valor': np.random.randint(20, size=10)})
df_ventas

   Oficina Producto  Valor
0        1        a     18
1        1        b      1
2        1        c     12
3        2        a      8
4        2        b      6
5        2        c     19
6        3        a     17
7        3        b      1
8        3        c     15
9        3        d     19

In [525]:
# Ventas de oficina 1
df_ventas[df_ventas['Oficina'] == 1]

   Oficina Producto  Valor
0        1        a     18
1        1        b      1
2        1        c     12

In [526]:
# Ventas de oficinas 1 y 2
df_ventas[df_ventas['Oficina'].isin([1,2])]

   Oficina Producto  Valor
0        1        a     18
1        1        b      1
2        1        c     12
3        2        a      8
4        2        b      6
5        2        c     19

In [527]:
df_ventas = pd.DataFrame({'Valor': np.random.random(10)},
                         index=[[1,1,1,2,2,2,3,3,3,3], 
                                ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d']])
# Se vuelve la oficina un índice
df_ventas = df_ventas.rename_axis(['Oficina','Producto'])
df_ventas

                     Valor
Oficina Producto
1       a         0.347043
        b         0.914267
        c         0.400664
2       a         0.641765
        b         0.906480
        c         0.023264
3       a         0.858902
        b         0.575298
        c         0.522716
        d         0.253971

In [528]:
df_ventas.loc[1]

             Valor
Producto
a         0.347043
b         0.914267
c         0.400664

In [529]:
df_ventas.loc[1:2]

                     Valor
Oficina Producto
1       a         0.347043
        b         0.914267
        c         0.400664
2       a         0.641765
        b         0.906480
        c         0.023264

### Intercambiando niveles de multi-indexamiento

In [530]:
#df_ventas
df_ventas2 = df_ventas.swaplevel('Oficina','Producto')
df_ventas2

                     Valor
Producto Oficina
a        1        0.347043
b        1        0.914267
c        1        0.400664
a        2        0.641765
b        2        0.906480
c        2        0.023264
a        3        0.858902
b        3        0.575298
c        3        0.522716
d        3        0.253971

In [531]:
df_ventas2.loc['a']

            Valor
Oficina
1        0.347043
2        0.641765
3        0.858902

### Agregaciones por nivel de indexamiento

In [432]:
# Todas las ventas por oficina
df_ventas.sum(level='Oficina')

            Valor
Oficina
1        1.720458
2        1.528225
3        1.722589

In [433]:
# # Todas las ventas por oficina
df_ventas.sum(level='Producto')

             Valor
Producto
a         1.639970
b         1.864463
c         1.355901
d         0.110937

### Tablas pivote

In [532]:
df_ventas = pd.DataFrame({'Oficina': [1,1,1,2,2,2,3,3,3,3],
                          'Producto': ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d'],
                          'Valor': np.random.randint(20, size=10)})
df_ventas[df_ventas['Oficina'].isin([1,2])]

   Oficina Producto  Valor
0        1        a     13
1        1        b      3
2        1        c     17
3        2        a     10
4        2        b     19
5        2        c      9

In [533]:
df_ventas.pivot(index='Oficina', columns='Producto', values='Valor')

Producto     a     b     c     d
Oficina
1         13.0   3.0  17.0   NaN
2         10.0  19.0   9.0   NaN
3          1.0   5.0   3.0  18.0

### Selección de sub dataframes por columna

In [436]:
df_ventas['Producto']

0    a
1    b
2    c
3    a
4    b
5    c
6    a
7    b
8    c
9    d
Name: Producto, dtype: object

In [437]:
df_ventas[['Producto', 'Valor']]

  Producto  Valor
0        a      2
1        b      9
2        c     17
3        a     12
4        b      0
5        c     12
6        a     19
7        b     17
8        c     16
9        d      9

### Ordenamientos

In [438]:
Empleado.sort_values(by='IDDepartamento')

    Apellido  IDDepartamento  Edad  Edad_meses
0    Andrade              31    20         240
1     Jordán              33    23         276
2  Steinberg              33    45         540
3   Róbinson              34    48         576
4     Zolano              34    56         672
5     Gaspar              36    32         384

In [439]:
Empleado.sort_values(by='IDDepartamento', ascending=False)

    Apellido  IDDepartamento  Edad  Edad_meses
5     Gaspar              36    32         384
3   Róbinson              34    48         576
4     Zolano              34    56         672
1     Jordán              33    23         276
2  Steinberg              33    45         540
0    Andrade              31    20         240

In [440]:
Empleado.sort_values(by=['IDDepartamento', 'Apellido'], ascending=[False, False])

    Apellido  IDDepartamento  Edad  Edad_meses
5     Gaspar              36    32         384
4     Zolano              34    56         672
3   Róbinson              34    48         576
2  Steinberg              33    45         540
1     Jordán              33    23         276
0    Andrade              31    20         240

### Iteraciones sobre grupos

In [534]:
# key: ID
# group: subDataframe
for key, group in Empleado.groupby('IDDepartamento'):
    print('=' * 50)
    print('IDDepartamento = {}'.format(key))
    print('-' * 50)
    print('DataFrame:')
    print(group)

==================================================
IDDepartamento = 31
--------------------------------------------------
DataFrame:
  Apellido  IDDepartamento  Edad  Edad_meses
0  Andrade              31    20         240
==================================================
IDDepartamento = 33
--------------------------------------------------
DataFrame:
    Apellido  IDDepartamento  Edad  Edad_meses
1     Jordán              33    23         276
2  Steinberg              33    45         540
==================================================
IDDepartamento = 34
--------------------------------------------------
DataFrame:
   Apellido  IDDepartamento  Edad  Edad_meses
3  Róbinson              34    48         576
4    Zolano              34    56         672
==================================================
IDDepartamento = 36
--------------------------------------------------
DataFrame:
  Apellido  IDDepartamento  Edad  Edad_meses
5   Gaspar              36    32         384

In [536]:
# Se extrae solamente la columna 'apellido'
for key, group in Empleado.groupby('IDDepartamento')['Apellido']:
    print('=' * 50)
    print('IDDepartamento = {}'.format(key))
    print('-' * 50)
    print('DataFrame:')
    print(group)

==================================================
IDDepartamento = 31
--------------------------------------------------
DataFrame:
0    Andrade
Name: Apellido, dtype: object
==================================================
IDDepartamento = 33
--------------------------------------------------
DataFrame:
1       Jordán
2    Steinberg
Name: Apellido, dtype: object
==================================================
IDDepartamento = 34
--------------------------------------------------
DataFrame:
3    Róbinson
4      Zolano
Name: Apellido, dtype: object
==================================================
IDDepartamento = 36
--------------------------------------------------
DataFrame:
5    Gaspar
Name: Apellido, dtype: object

### Agrupamiento aplicando estadísticas desriptivas

In [443]:
df_ventas = pd.DataFrame({'Oficina': np.random.choice([1, 2, 3], 50),
                          'Producto': np.random.choice(['a','b','c','d','e'], 50),
                          'Valor': np.random.randint(20, size=50)})

print(df_ventas)

    Oficina Producto  Valor
0         3        b     12
1         2        c      5
2         1        d      3
3         1        a     12
4         3        e     18
5         3        e      7
6         3        b      9
7         2        c      8
8         2        b     13
9         3        a     17
10        2        a     19
11        2        d     12
12        1        a      8
13        1        c      9
14        3        c      8
15        3        d     10
16        2        d     14
17        3        c      2
18        3        b      7
19        1        e      0
20        2        c     19
21        1        b      7
22        1        c      2
23        1        b      5
24        1        d      9
25        2        a     12
26        3        e      1
27        2        a     11
28        1        a     12
29        3        c     18
30        1        a      2
31        2        c      6
32        3        d      0
33        3        a      7
34        2        e      6
35        3        e      7
36        1        c     14
37        1        d     12
38        2        a      0
39        2        e      6
40        2        a      1
41        2        b     11
42        1        b      9
43        2        c      0
44        3        a      1
45        1        e     12
46        2        b     18
47        1        e      4
48        1        b      2
49        2        e      2

In [444]:
df_ventas.groupby(['Oficina', 'Producto']).sum()

                  Valor
Oficina Producto
1       a            34
        b            23
        c            25
        d            24
        e            16
2       a            43
        b            42
        c            38
        d            26
        e            14
3       a            25
        b            28
        c            28
        d            10
        e            33

### Tablas cruzadas

In [445]:
pd.crosstab(df_ventas['Oficina'], df_ventas['Producto'])

Producto  a  b  c  d  e
Oficina
1         4  4  3  3  3
2         5  3  5  2  3
3         3  3  3  2  4

In [446]:
pd.crosstab(df_ventas['Oficina'], df_ventas['Producto'], margins=True)

Producto   a   b   c  d   e  All
Oficina
1          4   4   3  3   3   17
2          5   3   5  2   3   18
3          3   3   3  2   4   15
All       12  10  11  7  10   50

# Estadísticos descriptivos y de asociación

## Estadísticos descriptivos

* Media
* Mediana
* Moda
* Máximo
* Mínimo
* Varianza
* Desviación estándar
* Rango intercuartílico

In [ ]:
! wget https://www.dropbox.com/s/kc98g3pjcp8trba/MCU2.csv

--2020-09-25 01:11:36--  https://www.dropbox.com/s/kc98g3pjcp8trba/MCU2.csv
Resolving www.dropbox.com (www.dropbox.com)... 162.125.5.1, 2620:100:601d:1::a27d:501
Connecting to www.dropbox.com (www.dropbox.com)|162.125.5.1|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/kc98g3pjcp8trba/MCU2.csv [following]
--2020-09-25 01:11:36--  https://www.dropbox.com/s/raw/kc98g3pjcp8trba/MCU2.csv
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://uc9a02830adb478ffdf2d49532b3.dl.dropboxusercontent.com/cd/0/inline/BADBxwTFXpoBPFd391xuNgE9HXaanijNxU_JMG0nsbZNC9zVucf0Wx4uMudMkxa2BUD6FWObw5LHcv6CFdDN3F8cQlPRrlN4mIJjoPtRYbWCrLrx3mzJUBmetOp67Uy83yU/file# [following]
--2020-09-25 01:11:36--  https://uc9a02830adb478ffdf2d49532b3.dl.dropboxusercontent.com/cd/0/inline/BADBxwTFXpoBPFd391xuNgE9HXaanijNxU_JMG0nsbZNC9zVucf0Wx4uMudMkxa2BUD6FWObw5LHcv6CFdDN3F8cQlPRrlN4mIJjoPtRYbWCrLrx3mzJUBmetOp67Uy83yU/file
Resolving uc9a02830adb478ffdf2d49532b3.dl.dropboxusercontent.com (uc9a02830adb478ffdf2d49532b3.dl.dropboxusercontent.com)... 162.125.5.15, 2620:100:601d:15::a27d:50f
Connecting to uc9a02830adb478ffdf2d49532b3.dl.dropboxusercontent.com (uc9a02830adb478ffdf2d49532b3.dl.dropboxusercontent.com)|162.125.5.15|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1890 (1.8K) [text/plain]
Saving to: ‘MCU2.csv.4’

MCU2.csv.4          100%[===================>]   1.85K  --.-KB/s    in 0s

2020-09-25 01:11:37 (202 MB/s) - ‘MCU2.csv.4’ saved [1890/1890]

In [ ]:
df_mcu = pd.read_csv('MCU2.csv')

In [ ]:
df_mcu = df_mcu.dropna()
df_mcu

    Iron Man  The Incredible Hulk  ...  Avengers: Infinity War  Ant-Man and The Wasp
0       17.0                 12.0  ...                      20                   9.0
1        8.0                  1.0  ...                       9                   9.0
2       20.0                 13.0  ...                      18                   8.0
6       17.0                 13.0  ...                      20                  19.0
7       10.0                 11.0  ...                      20                  17.0
8       14.0                  8.0  ...                      20                   5.0
9       16.0                 13.0  ...                      20                  14.0
10      15.0                  1.0  ...                      16                   7.0
11       1.0                  1.0  ...                       1                   1.0
12      11.0                  2.0  ...                      18                  13.0
13      15.0                 12.0  ...                      20                  16.0
14      16.0                  5.0  ...                      20                   9.0
19      18.0                 10.0  ...                      18                  18.0
28       7.0                  2.0  ...                      19                  11.0
29      10.0                  8.0  ...                      17                  13.0

[15 rows x 20 columns]

### Media y mediana

In [ ]:
# Elimina los NA/NAN por defecto
df_mcu.mean()

Iron Man                               13.000000
The Incredible Hulk                     7.466667
Iron Man 2                              8.266667
Thor                                    7.866667
Capitán América: el primer vengador    11.266667
The Avengers                           14.866667
Iron Man 3                              7.600000
Thor: The Dark World                    6.933333
Captain America: The Winter Soldier    13.133333
Guardianes de la Galaxia               13.266667
Avengers: Age of Ultron                12.533333
Ant-Man                                11.866667
Captain America: Civil War             15.200000
Doctor Strange                         12.133333
Guardianes de la Galaxia Vol. 2         9.666667
Spider-Man: Homecoming                 12.066667
Thor: Ragnarok                         10.800000
Black Panther                          11.533333
Avengers: Infinity War                 17.066667
Ant-Man and The Wasp                   11.266667
dtype: float64

In [ ]:
# Hacerlo por filas, por defecto lo hace por columnas (axis=0)
df_mcu.mean(axis=1)

0     11.95
1      7.25
2     12.65
6     18.20
7     10.50
8     10.50
9     14.45
10    11.90
11     1.05
12    10.50
13    14.55
14    10.50
19    13.85
28    10.50
29    12.50
dtype: float64

In [ ]:
# Para no eliminar los alores nulos
df_mcu.mean(skipna=False)

Iron Man                               13.000000
The Incredible Hulk                     7.466667
Iron Man 2                              8.266667
Thor                                    7.866667
Capitán América: el primer vengador    11.266667
The Avengers                           14.866667
Iron Man 3                              7.600000
Thor: The Dark World                    6.933333
Captain America: The Winter Soldier    13.133333
Guardianes de la Galaxia               13.266667
Avengers: Age of Ultron                12.533333
Ant-Man                                11.866667
Captain America: Civil War             15.200000
Doctor Strange                         12.133333
Guardianes de la Galaxia Vol. 2         9.666667
Spider-Man: Homecoming                 12.066667
Thor: Ragnarok                         10.800000
Black Panther                          11.533333
Avengers: Infinity War                 17.066667
Ant-Man and The Wasp                   11.266667
dtype: float64

In [ ]:
df_mcu.median()

Iron Man                               15.0
The Incredible Hulk                     8.0
Iron Man 2                              7.0
Thor                                    8.0
Capitán América: el primer vengador    11.0
The Avengers                           15.0
Iron Man 3                              7.0
Thor: The Dark World                    5.0
Captain America: The Winter Soldier    16.0
Guardianes de la Galaxia               15.0
Avengers: Age of Ultron                13.0
Ant-Man                                13.0
Captain America: Civil War             18.0
Doctor Strange                         15.0
Guardianes de la Galaxia Vol. 2         9.0
Spider-Man: Homecoming                 14.0
Thor: Ragnarok                         11.0
Black Panther                          15.0
Avengers: Infinity War                 19.0
Ant-Man and The Wasp                   11.0
dtype: float64

In [ ]:
# calcular la media de todas las columnas y luego obtener el resultados de una 
# columna especifica
df_mcu.mean()['Iron Man']

13.0

In [ ]:
# Extraer la columna que se necesita y luego calcular la media 
df_mcu['Iron Man'].mean()

13.0

### Moda

In [ ]:
df_mcu.mode()

   Iron Man  The Incredible Hulk  ...  Avengers: Infinity War  Ant-Man and The Wasp
0      10.0                  1.0  ...                    20.0                   9.0
1      15.0                 13.0  ...                     NaN                   NaN
2      16.0                  NaN  ...                     NaN                   NaN
3      17.0                  NaN  ...                     NaN                   NaN
4       NaN                  NaN  ...                     NaN                   NaN

[5 rows x 20 columns]

In [ ]:
df_mcu['Iron Man 2'].value_counts()

5.0     2
10.0    2
6.0     2
14.0    2
4.0     1
18.0    1
1.0     1
3.0     1
9.0     1
12.0    1
7.0     1
Name: Iron Man 2, dtype: int64

In [ ]:
df_mcu['Thor'].value_counts()

3.0     2
10.0    2
1.0     2
13.0    2
8.0     1
2.0     1
5.0     1
14.0    1
9.0     1
19.0    1
7.0     1
Name: Thor, dtype: int64

### Máximo y mínimo

In [ ]:
df_mcu.max()

Iron Man                               20.0
The Incredible Hulk                    13.0
Iron Man 2                             18.0
Thor                                   19.0
Capitán América: el primer vengador    20.0
The Avengers                           20.0
Iron Man 3                             15.0
Thor: The Dark World                   19.0
Captain America: The Winter Soldier    20.0
Guardianes de la Galaxia               20.0
Avengers: Age of Ultron                20.0
Ant-Man                                19.0
Captain America: Civil War             20.0
Doctor Strange                         20.0
Guardianes de la Galaxia Vol. 2        20.0
Spider-Man: Homecoming                 20.0
Thor: Ragnarok                         18.0
Black Panther                          20.0
Avengers: Infinity War                 20.0
Ant-Man and The Wasp                   19.0
dtype: float64

In [ ]:
# Ordenamiento ascendente
df_mcu.max().sort_values()

The Incredible Hulk                    13.0
Iron Man 3                             15.0
Iron Man 2                             18.0
Thor: Ragnarok                         18.0
Ant-Man and The Wasp                   19.0
Thor                                   19.0
Thor: The Dark World                   19.0
Ant-Man                                19.0
Black Panther                          20.0
Spider-Man: Homecoming                 20.0
Guardianes de la Galaxia Vol. 2        20.0
Doctor Strange                         20.0
Iron Man                               20.0
Avengers: Age of Ultron                20.0
Avengers: Infinity War                 20.0
Captain America: The Winter Soldier    20.0
The Avengers                           20.0
Capitán América: el primer vengador    20.0
Captain America: Civil War             20.0
Guardianes de la Galaxia               20.0
dtype: float64

In [ ]:
# Ordenamiento descendente
df_mcu.max().sort_values(ascending=False)

Guardianes de la Galaxia               20.0
Captain America: Civil War             20.0
Capitán América: el primer vengador    20.0
The Avengers                           20.0
Captain America: The Winter Soldier    20.0
Avengers: Infinity War                 20.0
Avengers: Age of Ultron                20.0
Iron Man                               20.0
Doctor Strange                         20.0
Guardianes de la Galaxia Vol. 2        20.0
Spider-Man: Homecoming                 20.0
Black Panther                          20.0
Ant-Man                                19.0
Thor: The Dark World                   19.0
Thor                                   19.0
Ant-Man and The Wasp                   19.0
Thor: Ragnarok                         18.0
Iron Man 2                             18.0
Iron Man 3                             15.0
The Incredible Hulk                    13.0
dtype: float64

In [ ]:
df_mcu.min()

Iron Man                               1.0
The Incredible Hulk                    1.0
Iron Man 2                             1.0
Thor                                   1.0
Capitán América: el primer vengador    1.0
The Avengers                           1.0
Iron Man 3                             1.0
Thor: The Dark World                   1.0
Captain America: The Winter Soldier    1.0
Guardianes de la Galaxia               2.0
Avengers: Age of Ultron                1.0
Ant-Man                                1.0
Captain America: Civil War             1.0
Doctor Strange                         1.0
Guardianes de la Galaxia Vol. 2        1.0
Spider-Man: Homecoming                 1.0
Thor: Ragnarok                         1.0
Black Panther                          1.0
Avengers: Infinity War                 1.0
Ant-Man and The Wasp                   1.0
dtype: float64

In [ ]:
df_mcu.max(axis=1)

0     20.0
1      9.0
2     20.0
6     20.0
7     20.0
8     20.0
9     20.0
10    20.0
11     2.0
12    20.0
13    20.0
14    20.0
19    18.0
28    20.0
29    18.0
dtype: float64

In [ ]:
df_mcu.max(skipna=False)

Iron Man                               20.0
The Incredible Hulk                    13.0
Iron Man 2                             18.0
Thor                                   19.0
Capitán América: el primer vengador    20.0
The Avengers                           20.0
Iron Man 3                             15.0
Thor: The Dark World                   19.0
Captain America: The Winter Soldier    20.0
Guardianes de la Galaxia               20.0
Avengers: Age of Ultron                20.0
Ant-Man                                19.0
Captain America: Civil War             20.0
Doctor Strange                         20.0
Guardianes de la Galaxia Vol. 2        20.0
Spider-Man: Homecoming                 20.0
Thor: Ragnarok                         18.0
Black Panther                          20.0
Avengers: Infinity War                 20.0
Ant-Man and The Wasp                   19.0
dtype: float64

### Desviación estándar y varianza

In [ ]:
disp = df_mcu.var()
disp

Iron Man                               25.714286
The Incredible Hulk                    24.552381
Iron Man 2                             22.352381
Thor                                   29.266667
Capitán América: el primer vengador    24.638095
The Avengers                           26.980952
Iron Man 3                             18.971429
Thor: The Dark World                   29.638095
Captain America: The Winter Soldier    33.980952
Guardianes de la Galaxia               26.780952
Avengers: Age of Ultron                25.695238
Ant-Man                                27.695238
Captain America: Civil War             35.314286
Doctor Strange                         41.695238
Guardianes de la Galaxia Vol. 2        42.809524
Spider-Man: Homecoming                 38.923810
Thor: Ragnarok                         30.742857
Black Panther                          47.552381
Avengers: Infinity War                 27.923810
Ant-Man and The Wasp                   25.923810
dtype: float64

In [ ]:
# varianza
disp = df_mcu.var()
disp = disp.sort_values()
disp

# desviasion estandar
disp = df_mcu.std()
disp = disp.sort_values()

# import plotly.express as px
# fig = px.bar(y=disp.index, x=disp.values,  orientation='h')
# fig.update_layout(title='Controversia generada por la película',
#                  xaxis_title="Controversia generada",
#                  yaxis_title="Película",)
# fig.show()

## Estadísticos de asociación

* Covarianza
* Correlación

### Matriz de varianzas y covarianzas, matriz de correlaciones

In [ ]:
cov = df_mcu.cov()
cov

                                      Iron Man  ...  Ant-Man and The Wasp
Iron Man                             25.714286  ...              9.928571
The Incredible Hulk                  17.071429  ...             13.723810
Iron Man 2                           12.142857  ...             15.280952
Thor                                 16.357143  ...             16.466667
Capitán América: el primer vengador  12.000000  ...             14.852381
The Avengers                         20.285714  ...             16.038095
Iron Man 3                            9.214286  ...             14.757143
Thor: The Dark World                  8.142857  ...             16.804762
Captain America: The Winter Soldier  13.714286  ...              8.604762
Guardianes de la Galaxia             23.857143  ...             10.709524
Avengers: Age of Ultron              16.000000  ...             13.633333
Ant-Man                              15.642857  ...             20.109524
Captain America: Civil War           22.428571  ...             10.514286
Doctor Strange                       15.714286  ...             14.247619
Guardianes de la Galaxia Vol. 2      12.714286  ...             18.238095
Spider-Man: Homecoming                9.785714  ...             24.052381
Thor: Ragnarok                       14.285714  ...              9.985714
Black Panther                        12.571429  ...              1.204762
Avengers: Infinity War               19.285714  ...             15.838095
Ant-Man and The Wasp                  9.928571  ...             25.923810

[20 rows x 20 columns]

In [ ]:
corr = df_mcu.corr() # Tipos de correlaciones

import plotly.graph_objects as go

fig = go.Figure(data=go.Heatmap(z=corr.values,
                        x=corr.columns.values,
                        y=corr.columns.values))
fig.show()

### Una visión global

In [ ]:
df_stats = df_mcu.describe()
df_stats

        Iron Man  ...  Ant-Man and The Wasp
count  15.000000  ...             15.000000
mean   13.000000  ...             11.266667
std     5.070926  ...              5.091543
min     1.000000  ...              1.000000
25%    10.000000  ...              8.500000
50%    15.000000  ...             11.000000
75%    16.500000  ...             15.000000
max    20.000000  ...             19.000000

[8 rows x 20 columns]

In [ ]:
df_stats = df_mcu.describe()
ri = df_stats.loc['75%'] - df_stats.loc['25%']
ri

Iron Man                                6.5
The Incredible Hulk                    10.0
Iron Man 2                              6.0
Thor                                    8.5
Capitán América: el primer vengador     7.0
The Avengers                            5.5
Iron Man 3                              6.5
Thor: The Dark World                    6.5
Captain America: The Winter Soldier    10.0
Guardianes de la Galaxia                7.0
Avengers: Age of Ultron                 7.0
Ant-Man                                 7.0
Captain America: Civil War              5.0
Doctor Strange                         10.5
Guardianes de la Galaxia Vol. 2         9.5
Spider-Man: Homecoming                  9.0
Thor: Ragnarok                          7.0
Black Panther                           9.0
Avengers: Infinity War                  2.5
Ant-Man and The Wasp                    6.5
dtype: float64

In [ ]:
df_stats = df_mcu.quantile([.75, .25])
df_stats.loc[0.75] - df_stats.loc[0.25]

Iron Man                                6.5
The Incredible Hulk                    10.0
Iron Man 2                              6.0
Thor                                    8.5
Capitán América: el primer vengador     7.0
The Avengers                            5.5
Iron Man 3                              6.5
Thor: The Dark World                    6.5
Captain America: The Winter Soldier    10.0
Guardianes de la Galaxia                7.0
Avengers: Age of Ultron                 7.0
Ant-Man                                 7.0
Captain America: Civil War              5.0
Doctor Strange                         10.5
Guardianes de la Galaxia Vol. 2         9.5
Spider-Man: Homecoming                  9.0
Thor: Ragnarok                          7.0
Black Panther                           9.0
Avengers: Infinity War                  2.5
Ant-Man and The Wasp                    6.5
dtype: float64